{
  "id_to_word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "10": "0000",
    "100": "170",
    "1000": "float",
    "1001": "float16",
    "1002": "float32",
    "1003": "flow",
    "1004": "flows",
    "1005": "focus",
    "1006": "followed",
    "1007": "follows",
    "1008": "foo",
    "1009": "for",
    "101": "1741",
    "1010": "forbidden",
    "1011": "forces",
    "1012": "forcing",
    "1013": "forget",
    "1014": "forgetting",
    "1015": "form",
    "1016": "formula",
    "1017": "formulas",
    "1018": "forward",
    "1019": "found",
    "102": "18",
    "1020": "foundational",
    "1021": "four",
    "1022": "fraction",
    "1023": "frameworks",
    "1024": "france",
    "1025": "frequencies",
    "1026": "frequency",
    "1027": "frequent",
    "1028": "frequently",
    "1029": "from",
    "103": "1832",
    "1030": "full",
    "1031": "fully",
    "1032": "function",
    "1033": "functional",
    "1034": "functions",
    "1035": "fundamental",
    "1036": "fundamentally",
    "1037": "future",
    "1038": "g",
    "1039": "gamma",
    "104": "19",
    "1040": "gamma1",
    "1041": "gamma2",
    "1042": "gap",
    "1043": "garbage",
    "1044": "gate",
    "1045": "gated",
    "1046": "gather",
    "1047": "gathered",
    "1048": "gathering",
    "1049": "gating",
    "105": "19m",
    "1050": "gelu",
    "1051": "general",
    "1052": "generalization",
    "1053": "generate",
    "1054": "generation",
    "1055": "geometric",
    "1056": "geometrically",
    "1057": "german",
    "1058": "get",
    "1059": "gets",
    "106": "1d",
    "1060": "geva",
    "1061": "gimpel",
    "1062": "given",
    "1063": "gives",
    "1064": "giving",
    "1065": "global",
    "1066": "goes",
    "1067": "gpt-2",
    "1068": "gpt-3",
    "1069": "gpus",
    "107": "1e-6",
    "1070": "gradient",
    "1071": "gradients",
    "1072": "granularity",
    "1073": "grow",
    "1074": "growing",
    "1075": "grows",
    "1076": "guaranteed",
    "1077": "guidance",
    "1078": "h",
    "1079": "hadamard",
    "108": "1x1",
    "1080": "half",
    "1081": "halves",
    "1082": "handle",
    "1083": "handled",
    "1084": "handles",
    "1085": "handling",
    "1086": "happens",
    "1087": "hard",
    "1088": "hardcoded",
    "1089": "harder",
    "109": "2",
    "1090": "has",
    "1091": "hash",
    "1092": "have",
    "1093": "he",
    "1094": "head",
    "1095": "head's",
    "1096": "head_outputs",
    "1097": "heads",
    "1098": "healthy",
    "1099": "hello",
    "11": "00003",
    "110": "2-3",
    "1100": "helper",
    "1101": "helps",
    "1102": "hendrycks",
    "1103": "here",
    "1104": "hidden",
    "1105": "high",
    "1106": "high-dimensional",
    "1107": "higher",
    "1108": "higher-dimensional",
    "1109": "higher-frequency",
    "111": "20",
    "1110": "highest",
    "1111": "highly",
    "1112": "highways",
    "1113": "hint",
    "1114": "hinton",
    "1115": "historically",
    "1116": "holds",
    "1117": "hot",
    "1118": "hours",
    "1119": "how",
    "112": "200",
    "1120": "however",
    "1121": "human-interpretable",
    "1122": "human-readable",
    "1123": "hundreds",
    "1124": "hurt",
    "1125": "i",
    "1126": "i's",
    "1127": "id",
    "1128": "id_to_word",
    "1129": "idea",
    "113": "2013",
    "1130": "identical",
    "1131": "identically",
    "1132": "identification",
    "1133": "identifies",
    "1134": "identity",
    "1135": "ids",
    "1136": "idx",
    "1137": "if",
    "1138": "ij",
    "1139": "illustration",
    "114": "2015",
    "1140": "implement",
    "1141": "implementation",
    "1142": "implementations",
    "1143": "implemented",
    "1144": "implementing",
    "1145": "implications",
    "1146": "implicit",
    "1147": "import",
    "1148": "important",
    "1149": "improve",
    "115": "2016",
    "1150": "improves",
    "1151": "in",
    "1152": "include",
    "1153": "includes",
    "1154": "including",
    "1155": "inconsistent",
    "1156": "incorrect",
    "1157": "increasing",
    "1158": "increasingly",
    "1159": "independence",
    "116": "2017",
    "1160": "independent",
    "1161": "independently",
    "1162": "index",
    "1163": "index-based",
    "1164": "indexing",
    "1165": "indicate",
    "1166": "indices",
    "1167": "indistinguishable",
    "1168": "individual",
    "1169": "inference",
    "117": "2019",
    "1170": "inflate",
    "1171": "inflated",
    "1172": "information",
    "1173": "inherently",
    "1174": "inhibits",
    "1175": "init",
    "1176": "initial",
    "1177": "initialization",
    "1178": "initialize",
    "1179": "initialized",
    "118": "2020",
    "1180": "initializing",
    "1181": "inject",
    "1182": "inner",
    "1183": "input",
    "1184": "inputs",
    "1185": "insertion",
    "1186": "inside",
    "1187": "insidious",
    "1188": "insight",
    "1189": "inspired",
    "119": "2021",
    "1190": "instability",
    "1191": "instance",
    "1192": "instances",
    "1193": "instead",
    "1194": "int",
    "1195": "int32",
    "1196": "int64",
    "1197": "integer",
    "1198": "integerid_to_word",
    "1199": "integers",
    "12": "001",
    "120": "2022",
    "1200": "intended",
    "1201": "intending",
    "1202": "intentional",
    "1203": "interact",
    "1204": "interaction",
    "1205": "interacts",
    "1206": "interleaved",
    "1207": "interleaving",
    "1208": "intermediate",
    "1209": "internal",
    "121": "2048",
    "1210": "internally",
    "1211": "interpretability",
    "1212": "into",
    "1213": "introduced",
    "1214": "introduces",
    "1215": "intuitive",
    "1216": "invariance",
    "1217": "inverse",
    "1218": "inverted",
    "1219": "involved",
    "122": "2094",
    "1220": "ioffe",
    "1221": "irrecoverably",
    "1222": "irreversible",
    "1223": "is",
    "1224": "isolation",
    "1225": "issues",
    "1226": "it",
    "1227": "items",
    "1228": "iterate",
    "1229": "iteration",
    "123": "21",
    "1230": "its",
    "1231": "itself",
    "1232": "j",
    "1233": "jacobian",
    "1234": "join",
    "1235": "joining",
    "1236": "joins",
    "1237": "jointly",
    "1238": "just",
    "1239": "k",
    "124": "211",
    "1240": "k_heads",
    "1241": "k_proj",
    "1242": "keep",
    "1243": "keepdims",
    "1244": "keeping",
    "1245": "kept",
    "1246": "kernel",
    "1247": "kernels",
    "1248": "key",
    "1249": "key-value",
    "125": "216",
    "1250": "keyerror",
    "1251": "keys",
    "1252": "kiros",
    "1253": "knowledge",
    "1254": "known",
    "1255": "kq",
    "1256": "kw",
    "1257": "l",
    "1258": "labor",
    "1259": "landscape",
    "126": "22",
    "1260": "language",
    "1261": "languages",
    "1262": "large",
    "1263": "large-magnitude",
    "1264": "large-scale",
    "1265": "larger",
    "1266": "largest",
    "1267": "last",
    "1268": "later",
    "1269": "layer",
    "127": "224",
    "1270": "layer-normalized",
    "1271": "layer_norm",
    "1272": "layernorm",
    "1273": "layers",
    "1274": "leads",
    "1275": "leaning",
    "1276": "leans",
    "1277": "learn",
    "1278": "learnable",
    "1279": "learned",
    "128": "2247",
    "1280": "learning",
    "1281": "learns",
    "1282": "len",
    "1283": "length",
    "1284": "lengths",
    "1285": "less",
    "1286": "lessons",
    "1287": "let",
    "1288": "level",
    "1289": "lexicographic",
    "129": "225",
    "1290": "lies",
    "1291": "like",
    "1292": "limits",
    "1293": "lin",
    "1294": "linear",
    "1295": "linear-relu",
    "1296": "linearity",
    "1297": "linearly",
    "1298": "list",
    "1299": "literal",
    "13": "0022",
    "130": "23x",
    "1300": "literature",
    "1301": "llama",
    "1302": "llms",
    "1303": "ln",
    "1304": "local",
    "1305": "log",
    "1306": "logits",
    "1307": "long-context",
    "1308": "longer",
    "1309": "longest",
    "131": "24",
    "1310": "longtensor",
    "1311": "look",
    "1312": "looked",
    "1313": "looking",
    "1314": "lookup",
    "1315": "loses",
    "1316": "loss",
    "1317": "lost",
    "1318": "low",
    "1319": "lower",
    "132": "25",
    "1320": "lower-frequency",
    "1321": "lowercase",
    "1322": "lowercased",
    "1323": "lowercasing",
    "1324": "lowest",
    "1325": "m",
    "1326": "machine",
    "1327": "magnitude",
    "1328": "magnitude-balancing",
    "1329": "magnitudes",
    "133": "2502",
    "1330": "maintains",
    "1331": "major",
    "1332": "make",
    "1333": "makes",
    "1334": "making",
    "1335": "manages",
    "1336": "many",
    "1337": "map",
    "1338": "mapped",
    "1339": "mapping",
    "134": "255",
    "1340": "maps",
    "1341": "marks",
    "1342": "mask",
    "1343": "masked",
    "1344": "masking",
    "1345": "masks",
    "1346": "mass",
    "1347": "mat",
    "1348": "match",
    "1349": "matches",
    "135": "256",
    "1350": "matching",
    "1351": "math",
    "1352": "matmul",
    "1353": "matrices",
    "1354": "matrix",
    "1355": "matters",
    "1356": "max",
    "1357": "maximum",
    "1358": "may",
    "1359": "me",
    "136": "257",
    "1360": "mean",
    "1361": "meaning",
    "1362": "meaningful",
    "1363": "meaningfully",
    "1364": "meaningless",
    "1365": "means",
    "1366": "measures",
    "1367": "mechanism",
    "1368": "mechanism's",
    "1369": "mechanisms",
    "137": "26",
    "1370": "medium",
    "1371": "megabytes",
    "1372": "memories",
    "1373": "memorizing",
    "1374": "memory",
    "1375": "merely",
    "1376": "merge",
    "1377": "merges",
    "1378": "methods",
    "1379": "mha",
    "138": "2645",
    "1380": "middle",
    "1381": "might",
    "1382": "million",
    "1383": "mini-batch",
    "1384": "minimal",
    "1385": "minimizing",
    "1386": "mirrors",
    "1387": "mismatch",
    "1388": "missing",
    "1389": "mistake",
    "139": "2764",
    "1390": "mistakes",
    "1391": "mistral",
    "1392": "mitigates",
    "1393": "mix",
    "1394": "mixed",
    "1395": "mixed-precision",
    "1396": "mixes",
    "1397": "mixing",
    "1398": "mlp",
    "1399": "model",
    "14": "0043",
    "140": "28",
    "1400": "model's",
    "1401": "modeling",
    "1402": "models",
    "1403": "moderately",
    "1404": "modern",
    "1405": "modification",
    "1406": "momentum",
    "1407": "money",
    "1408": "monotonicity",
    "1409": "more",
    "141": "2974",
    "1410": "morphological",
    "1411": "morphologically",
    "1412": "most",
    "1413": "mostly",
    "1414": "motivation",
    "1415": "moved",
    "1416": "moving",
    "1417": "much",
    "1418": "multi",
    "1419": "multi-frequency",
    "142": "2d",
    "1420": "multi-head",
    "1421": "multi-scale",
    "1422": "multi-step",
    "1423": "multi_head_attention",
    "1424": "multihead",
    "1425": "multiheadattention",
    "1426": "multiple",
    "1427": "multiplication",
    "1428": "multiplications",
    "1429": "multiplied",
    "143": "2i",
    "1430": "multiplier",
    "1431": "multiplies",
    "1432": "multiply",
    "1433": "multiplying",
    "1434": "must",
    "1435": "n",
    "1436": "natural",
    "1437": "naturally",
    "1438": "nature",
    "1439": "ndarray",
    "144": "3",
    "1440": "near",
    "1441": "near-one",
    "1442": "nearby",
    "1443": "nearest",
    "1444": "nearly",
    "1445": "need",
    "1446": "needed",
    "1447": "needs",
    "1448": "negative",
    "1449": "network",
    "145": "30",
    "1450": "network-in",
    "1451": "networks",
    "1452": "neural",
    "1453": "neurips",
    "1454": "never",
    "1455": "new",
    "1456": "newaxis",
    "1457": "next",
    "1458": "next-token",
    "1459": "next_id",
    "146": "31",
    "1460": "nlp",
    "1461": "nn",
    "1462": "no",
    "1463": "noise",
    "1464": "non-deterministic",
    "1465": "non-linearity",
    "1466": "non-lowercased",
    "1467": "non-padding",
    "1468": "non-trivial",
    "1469": "non-zero",
    "147": "32",
    "1470": "none",
    "1471": "nonlinear",
    "1472": "nonlinearity",
    "1473": "norm",
    "1474": "normal_",
    "1475": "normalization",
    "1476": "normalize",
    "1477": "normalized",
    "1478": "normalizes",
    "1479": "normalizing",
    "148": "320",
    "1480": "norms",
    "1481": "not",
    "1482": "notably",
    "1483": "notes",
    "1484": "notion",
    "1485": "nouns",
    "1486": "novel",
    "1487": "now",
    "1488": "np",
    "1489": "num",
    "149": "333",
    "1490": "num_heads",
    "1491": "number",
    "1492": "numerical",
    "1493": "numpy",
    "1494": "o",
    "1495": "observations",
    "1496": "obtain",
    "1497": "occurs",
    "1498": "odd",
    "1499": "odd-indexed",
    "15": "0065",
    "150": "3395",
    "1500": "of",
    "1501": "off-by",
    "1502": "offset",
    "1503": "often",
    "1504": "omitting",
    "1505": "on",
    "1506": "once",
    "1507": "one",
    "1508": "one-hot",
    "1509": "ones",
    "151": "34",
    "1510": "only",
    "1511": "oov",
    "1512": "operate",
    "1513": "operates",
    "1514": "operation",
    "1515": "operations",
    "1516": "optimal",
    "1517": "optimization",
    "1518": "optimized",
    "1519": "optimizer",
    "152": "3416",
    "1520": "optional",
    "1521": "or",
    "1522": "order",
    "1523": "ordering",
    "1524": "origin",
    "1525": "original",
    "1526": "originally",
    "1527": "oscillations",
    "1528": "other",
    "1529": "others",
    "153": "35",
    "1530": "otherwise",
    "1531": "our",
    "1532": "out",
    "1533": "out-of",
    "1534": "outer",
    "1535": "output",
    "1536": "outputs",
    "1537": "outside",
    "1538": "over",
    "1539": "over-scales",
    "154": "354",
    "1540": "over-scaling",
    "1541": "overfit",
    "1542": "overflow",
    "1543": "overflows",
    "1544": "overhead",
    "1545": "overlap",
    "1546": "overlook",
    "1547": "overly",
    "1548": "overwriting",
    "1549": "own",
    "155": "3568",
    "1550": "p",
    "1551": "pad",
    "1552": "pad_token",
    "1553": "padding",
    "1554": "pair",
    "1555": "paired",
    "1556": "pairing",
    "1557": "pairs",
    "1558": "palm",
    "1559": "paper",
    "156": "36",
    "1560": "paper's",
    "1561": "parallel",
    "1562": "parallelism",
    "1563": "parallelizable",
    "1564": "parameter",
    "1565": "parameter-free",
    "1566": "parameters",
    "1567": "paris",
    "1568": "part",
    "1569": "partially",
    "157": "3612",
    "1570": "particular",
    "1571": "particularly",
    "1572": "pass",
    "1573": "passage",
    "1574": "passed",
    "1575": "passes",
    "1576": "passing",
    "1577": "path",
    "1578": "pattern",
    "1579": "patterns",
    "158": "37",
    "1580": "pause",
    "1581": "pe",
    "1582": "peaked",
    "1583": "per",
    "1584": "per-element",
    "1585": "per-feature",
    "1586": "per-head",
    "1587": "per-position",
    "1588": "per-sample",
    "1589": "per-token",
    "159": "37000",
    "1590": "perfect",
    "1591": "perfectly",
    "1592": "perform",
    "1593": "performance",
    "1594": "performed",
    "1595": "performing",
    "1596": "performs",
    "1597": "periodic",
    "1598": "periodicity",
    "1599": "permanent",
    "16": "01",
    "160": "3779",
    "1600": "permutation",
    "1601": "permute",
    "1602": "phenomenon",
    "1603": "phrase",
    "1604": "physical",
    "1605": "pieces",
    "1606": "pipeline",
    "1607": "pitfalls",
    "1608": "place",
    "1609": "placement",
    "161": "38",
    "1610": "placing",
    "1611": "plateaus",
    "1612": "plus",
    "1613": "point",
    "1614": "pos",
    "1615": "position",
    "1616": "position's",
    "1617": "position-dependent",
    "1618": "position-wise",
    "1619": "positional",
    "162": "38m",
    "1620": "positional_encoding",
    "1621": "positions",
    "1622": "positive",
    "1623": "possible",
    "1624": "post",
    "1625": "post-layernorm",
    "1626": "post-norm",
    "1627": "potentially",
    "1628": "power",
    "1629": "practical",
    "163": "39",
    "1630": "practically",
    "1631": "practice",
    "1632": "pre-norm",
    "1633": "pre-normalization",
    "1634": "pre-relu",
    "1635": "pre-softmax",
    "1636": "preceding",
    "1637": "predicting",
    "1638": "predictions",
    "1639": "preferred",
    "164": "393",
    "1640": "preserved",
    "1641": "preserves",
    "1642": "press",
    "1643": "pretrained",
    "1644": "prevent",
    "1645": "preventing",
    "1646": "prevents",
    "1647": "previous",
    "1648": "primary",
    "1649": "principle",
    "165": "3h",
    "1650": "principled",
    "1651": "probabilistic",
    "1652": "probabilities",
    "1653": "probability",
    "1654": "problem",
    "1655": "problems",
    "1656": "procedure",
    "1657": "proceeds",
    "1658": "process",
    "1659": "processed",
    "166": "4",
    "1660": "processes",
    "1661": "processing",
    "1662": "produce",
    "1663": "produced",
    "1664": "produces",
    "1665": "producing",
    "1666": "product",
    "1667": "production",
    "1668": "products",
    "1669": "profound",
    "167": "4-dimensional",
    "1670": "progression",
    "1671": "progressive",
    "1672": "project",
    "1673": "projected",
    "1674": "projecting",
    "1675": "projection",
    "1676": "projections",
    "1677": "projects",
    "1678": "proper",
    "1679": "property",
    "168": "40",
    "1680": "proportionally",
    "1681": "proposed",
    "1682": "provide",
    "1683": "provided",
    "1684": "provides",
    "1685": "providing",
    "1686": "proximity",
    "1687": "publication",
    "1688": "pulling",
    "1689": "punctuation",
    "169": "4096",
    "1690": "punctuation-attached",
    "1691": "pure",
    "1692": "purely",
    "1693": "purpose",
    "1694": "purposes",
    "1695": "push",
    "1696": "pushing",
    "1697": "python's",
    "1698": "pytorch",
    "1699": "q",
    "17": "0100",
    "170": "414",
    "1700": "q_heads",
    "1701": "q_proj",
    "1702": "qk",
    "1703": "quadratic",
    "1704": "quality",
    "1705": "queries",
    "1706": "query",
    "1707": "query's",
    "1708": "query-key",
    "1709": "question",
    "171": "416",
    "1710": "qw",
    "1711": "r",
    "1712": "radford",
    "1713": "raise",
    "1714": "raising",
    "1715": "random",
    "1716": "randomization",
    "1717": "range",
    "1718": "ranges",
    "1719": "ranging",
    "172": "4161",
    "1720": "rapidly",
    "1721": "rare",
    "1722": "rarely",
    "1723": "rate",
    "1724": "rates",
    "1725": "rather",
    "1726": "ratio",
    "1727": "raw",
    "1728": "re-centers",
    "1729": "re-scales",
    "173": "42",
    "1730": "reach",
    "1731": "read",
    "1732": "real",
    "1733": "real-valued",
    "1734": "reason",
    "1735": "reasoning",
    "1736": "reasons",
    "1737": "receive",
    "1738": "receives",
    "1739": "recently",
    "174": "425",
    "1740": "receptive",
    "1741": "recombines",
    "1742": "reconstructs",
    "1743": "recovers",
    "1744": "rectified",
    "1745": "recurrence",
    "1746": "recurrent",
    "1747": "reduced",
    "1748": "reduces",
    "1749": "reducing",
    "175": "43",
    "1750": "reduction",
    "1751": "refers",
    "1752": "refinement",
    "1753": "refines",
    "1754": "reflects",
    "1755": "regardless",
    "1756": "regime",
    "1757": "regions",
    "1758": "regular",
    "1759": "regularization",
    "176": "4472",
    "1760": "relationship",
    "1761": "relationships",
    "1762": "relative",
    "1763": "relaxes",
    "1764": "relevant",
    "1765": "relu",
    "1766": "relu-based",
    "1767": "relu_out",
    "1768": "remain",
    "1769": "remaining",
    "177": "453",
    "1770": "remains",
    "1771": "remove",
    "1772": "removing",
    "1773": "repeated",
    "1774": "repeating",
    "1775": "replaced",
    "1776": "replacements",
    "1777": "report",
    "1778": "represent",
    "1779": "representation",
    "178": "4558",
    "1780": "representational",
    "1781": "representations",
    "1782": "representing",
    "1783": "reproducibility",
    "1784": "reproducible",
    "1785": "required",
    "1786": "requirements",
    "1787": "requires",
    "1788": "rescales",
    "1789": "research",
    "179": "456",
    "1790": "researchers",
    "1791": "reserve",
    "1792": "reserved",
    "1793": "reshape",
    "1794": "reshapes",
    "1795": "reshaping",
    "1796": "residual",
    "1797": "residuals",
    "1798": "resnets",
    "1799": "resolves",
    "18": "011",
    "180": "46",
    "1800": "respect",
    "1801": "respective",
    "1802": "rest",
    "1803": "restrictive",
    "1804": "result",
    "1805": "resulting",
    "1806": "results",
    "1807": "retrieval",
    "1808": "retrieve",
    "1809": "retrieved",
    "181": "467",
    "1810": "return",
    "1811": "returning",
    "1812": "returns",
    "1813": "reverse",
    "1814": "reversed",
    "1815": "reverses",
    "1816": "rewriting",
    "1817": "rich",
    "1818": "richer",
    "1819": "right",
    "182": "469",
    "1820": "rigid",
    "1821": "river",
    "1822": "rnns",
    "1823": "robustness",
    "1824": "role",
    "1825": "roles",
    "1826": "root",
    "1827": "rooted",
    "1828": "rope",
    "1829": "rotates",
    "183": "4711",
    "1830": "rotation",
    "1831": "roughly",
    "1832": "round-trip",
    "1833": "row",
    "1834": "row-wise",
    "1835": "rows",
    "1836": "run",
    "1837": "runner",
    "1838": "running",
    "1839": "runs",
    "184": "4d",
    "1840": "runtime",
    "1841": "s",
    "1842": "same",
    "1843": "sample",
    "1844": "samples",
    "1845": "sat",
    "1846": "saturated",
    "1847": "saturation",
    "1848": "saving",
    "1849": "savings",
    "185": "4for",
    "1850": "scalar",
    "1851": "scale",
    "1852": "scaled",
    "1853": "scaled_dot_product_attention",
    "1854": "scales",
    "1855": "scaling",
    "1856": "scatters",
    "1857": "score",
    "1858": "scores",
    "1859": "second",
    "186": "4x",
    "1860": "seconds",
    "1861": "section",
    "1862": "see",
    "1863": "seed",
    "1864": "seeing",
    "1865": "seen",
    "1866": "sees",
    "1867": "selected",
    "1868": "selecting",
    "1869": "selectively",
    "187": "5",
    "1870": "self",
    "1871": "self-attention",
    "1872": "semantic",
    "1873": "semantics",
    "1874": "sensitive",
    "1875": "sensitivity",
    "1876": "sentence",
    "1877": "sentences",
    "1878": "separate",
    "1879": "separated",
    "188": "50",
    "1880": "separately",
    "1881": "separation",
    "1882": "separator",
    "1883": "seq_len",
    "1884": "seq_len_k",
    "1885": "seq_len_q",
    "1886": "seq_length",
    "1887": "sequence",
    "1888": "sequence_length",
    "1889": "sequences",
    "189": "5000",
    "1890": "sequential",
    "1891": "sequentially",
    "1892": "serve",
    "1893": "serves",
    "1894": "set",
    "1895": "setting",
    "1896": "setup",
    "1897": "several",
    "1898": "sgd",
    "1899": "shape",
    "19": "0111",
    "190": "5042",
    "1900": "shapes",
    "1901": "share",
    "1902": "shared",
    "1903": "shares",
    "1904": "sharing",
    "1905": "sharp",
    "1906": "shazeer",
    "1907": "shift",
    "1908": "shifted",
    "1909": "shifts",
    "191": "507",
    "1910": "shorter",
    "1911": "shortest",
    "1912": "should",
    "1913": "showed",
    "1914": "shown",
    "1915": "shuffling",
    "1916": "side",
    "1917": "signal",
    "1918": "signals",
    "1919": "significantly",
    "192": "5071",
    "1920": "silent",
    "1921": "silently",
    "1922": "silu",
    "1923": "similar",
    "1924": "similarity",
    "1925": "simple",
    "1926": "simplest",
    "1927": "simpletokenizer",
    "1928": "simplicity",
    "1929": "simply",
    "193": "511",
    "1930": "simultaneously",
    "1931": "sin",
    "1932": "since",
    "1933": "sine",
    "1934": "single",
    "1935": "single-head",
    "1936": "single-sample",
    "1937": "sinusoidal",
    "1938": "sinusoids",
    "1939": "site",
    "194": "512",
    "1940": "size",
    "1941": "sizes",
    "1942": "skip",
    "1943": "skipping",
    "1944": "skips",
    "1945": "slice",
    "1946": "slightly",
    "1947": "slower",
    "1948": "slowest",
    "1949": "slowing",
    "195": "512-dimensional",
    "1950": "slowly",
    "1951": "small",
    "1952": "smaller",
    "1953": "smooth",
    "1954": "smoother",
    "1955": "so",
    "1956": "soft",
    "1957": "softmax",
    "1958": "sole",
    "1959": "solved",
    "196": "5162",
    "1960": "solves",
    "1961": "some",
    "1962": "something",
    "1963": "sort",
    "1964": "sorted",
    "1965": "sorting",
    "1966": "source",
    "1967": "source-target",
    "1968": "sources",
    "1969": "space",
    "197": "52",
    "1970": "space-efficient",
    "1971": "space-joined",
    "1972": "spaces",
    "1973": "spans",
    "1974": "sparse",
    "1975": "sparsifies",
    "1976": "sparsity",
    "1977": "spatial",
    "1978": "special",
    "1979": "special_tokens",
    "198": "5213",
    "1980": "specialization",
    "1981": "specialize",
    "1982": "specific",
    "1983": "specifies",
    "1984": "spectrum",
    "1985": "split",
    "1986": "splits",
    "1987": "splitting",
    "1988": "spread",
    "1989": "spurious",
    "199": "522",
    "1990": "sqrt",
    "1991": "square",
    "1992": "stability",
    "1993": "stabilizes",
    "1994": "stabilizing",
    "1995": "stable",
    "1996": "stack",
    "1997": "stacked",
    "1998": "stacking",
    "1999": "stacks",
    "2": "<BOS>",
    "20": "0125",
    "200": "5222",
    "2000": "stage",
    "2001": "stall",
    "2002": "standard",
    "2003": "starting",
    "2004": "starts",
    "2005": "state",
    "2006": "states",
    "2007": "statistical",
    "2008": "statistics",
    "2009": "stay",
    "201": "5248",
    "2010": "stays",
    "2011": "std",
    "2012": "step",
    "2013": "steps",
    "2014": "still",
    "2015": "stop",
    "2016": "store",
    "2017": "stored",
    "2018": "storing",
    "2019": "str",
    "202": "5376",
    "2020": "straightforward",
    "2021": "strategy",
    "2022": "string",
    "2023": "strings",
    "2024": "strong",
    "2025": "stronger",
    "2026": "strongly",
    "2027": "structural",
    "2028": "structure",
    "2029": "studies",
    "203": "54",
    "2030": "study",
    "2031": "su",
    "2032": "sub-layer",
    "2033": "sub-layers",
    "2034": "subject-verb",
    "2035": "sublayer",
    "2036": "sublayeroutput",
    "2037": "sublayers",
    "2038": "submission",
    "2039": "subsequent",
    "204": "5403",
    "2040": "subset",
    "2041": "subspace",
    "2042": "subspaces",
    "2043": "subtract",
    "2044": "subtracting",
    "2045": "subtraction",
    "2046": "subword",
    "2047": "successful",
    "2048": "successive",
    "2049": "such",
    "205": "541",
    "2050": "suffer",
    "2051": "sufficient",
    "2052": "suggests",
    "2053": "sum",
    "2054": "sum-to",
    "2055": "summary",
    "2056": "summing",
    "2057": "sums",
    "2058": "superseded",
    "2059": "suppose",
    "206": "56",
    "2060": "surface",
    "2061": "survive",
    "2062": "surviving",
    "2063": "suspect",
    "2064": "swapping",
    "2065": "swiglu",
    "2066": "symmetry",
    "2067": "symptoms",
    "2068": "syntactic",
    "2069": "systematically",
    "207": "576",
    "2070": "szegedy",
    "2071": "t",
    "2072": "table",
    "2073": "takes",
    "2074": "talk",
    "2075": "tanh",
    "2076": "target",
    "2077": "task-ready",
    "2078": "task-specific",
    "2079": "technique",
    "208": "584",
    "2080": "techniques",
    "2081": "tells",
    "2082": "temperature",
    "2083": "tend",
    "2084": "tensor",
    "2085": "tensorflow",
    "2086": "tensors",
    "2087": "tensortonic",
    "2088": "term",
    "2089": "terminates",
    "209": "595",
    "2090": "terms",
    "2091": "test",
    "2092": "tested",
    "2093": "text",
    "2094": "texts",
    "2095": "than",
    "2096": "that",
    "2097": "the",
    "2098": "their",
    "2099": "them",
    "21": "0155",
    "210": "6",
    "2100": "then",
    "2101": "theoretically",
    "2102": "theory",
    "2103": "there",
    "2104": "therefore",
    "2105": "these",
    "2106": "they",
    "2107": "think",
    "2108": "third",
    "2109": "this",
    "211": "6-layer",
    "2110": "those",
    "2111": "though",
    "2112": "three",
    "2113": "through",
    "2114": "throughout",
    "2115": "tie",
    "2116": "time",
    "2117": "times",
    "2118": "timestep",
    "2119": "tiny",
    "212": "6016",
    "2120": "to",
    "2121": "together",
    "2122": "token",
    "2123": "token's",
    "2124": "token-to",
    "2125": "tokenization",
    "2126": "tokenize",
    "2127": "tokenizer",
    "2128": "tokens",
    "2129": "tolerating",
    "213": "62",
    "2130": "too",
    "2131": "too-large",
    "2132": "torch",
    "2133": "total",
    "2134": "totaling",
    "2135": "toward",
    "2136": "toy",
    "2137": "tpus",
    "2138": "trace",
    "2139": "track",
    "214": "627",
    "2140": "tradeoff",
    "2141": "tradeoffs",
    "2142": "train",
    "2143": "train-test",
    "2144": "trainable",
    "2145": "trained",
    "2146": "training",
    "2147": "transform",
    "2148": "transformation",
    "2149": "transformations",
    "215": "64",
    "2150": "transformed",
    "2151": "transformer",
    "2152": "transformer's",
    "2153": "transformerification",
    "2154": "transformers",
    "2155": "transforms",
    "2156": "translation",
    "2157": "transpose",
    "2158": "transposed",
    "2159": "treat",
    "216": "64-dimensional",
    "2160": "treating",
    "2161": "treats",
    "2162": "triangular",
    "2163": "trick",
    "2164": "triggering",
    "2165": "trigonometric",
    "2166": "trivially",
    "2167": "true",
    "2168": "tunable",
    "2169": "turkish",
    "217": "66",
    "2170": "two",
    "2171": "two-layer",
    "2172": "two-thirds",
    "2173": "tying",
    "2174": "type",
    "2175": "types",
    "2176": "typical",
    "2177": "typically",
    "2178": "typing",
    "2179": "typos",
    "218": "6605",
    "2180": "unaffected",
    "2181": "unambiguous",
    "2182": "unchanged",
    "2183": "under",
    "2184": "understanding",
    "2185": "underweighting",
    "2186": "unexpected",
    "2187": "unified",
    "2188": "uniform",
    "2189": "uniformly",
    "219": "6833",
    "2190": "unigram",
    "2191": "unique",
    "2192": "uniquely",
    "2193": "unit",
    "2194": "units",
    "2195": "unk",
    "2196": "unk_id",
    "2197": "unk_token",
    "2198": "unknown",
    "2199": "unlike",
    "22": "0182",
    "220": "7",
    "2200": "unnormalized",
    "2201": "unscaled",
    "2202": "unstable",
    "2203": "up",
    "2204": "update",
    "2205": "updated",
    "2206": "updates",
    "2207": "us",
    "2208": "use",
    "2209": "used",
    "221": "7057",
    "2210": "useful",
    "2211": "uses",
    "2212": "using",
    "2213": "v",
    "2214": "v_heads",
    "2215": "v_proj",
    "2216": "valid",
    "2217": "valleys",
    "2218": "value",
    "2219": "valueerror",
    "222": "707",
    "2220": "values",
    "2221": "vanish",
    "2222": "vanishes",
    "2223": "vanishing",
    "2224": "vanishingly",
    "2225": "var",
    "2226": "variable",
    "2227": "variance",
    "2228": "variant",
    "2229": "variants",
    "223": "712",
    "2230": "vaswani",
    "2231": "vector",
    "2232": "vectors",
    "2233": "verify",
    "2234": "version",
    "2235": "very",
    "2236": "via",
    "2237": "view",
    "2238": "violate",
    "2239": "virtually",
    "224": "720",
    "2240": "vit",
    "2241": "vocab",
    "2242": "vocab_size",
    "2243": "vocabularies",
    "2244": "vocabulary",
    "2245": "vs",
    "2246": "vw",
    "2247": "w",
    "2248": "w1",
    "2249": "w2",
    "225": "730",
    "2250": "w_k",
    "2251": "w_o",
    "2252": "w_q",
    "2253": "w_v",
    "2254": "walk",
    "2255": "warmup",
    "2256": "was",
    "2257": "waste",
    "2258": "wavelength",
    "2259": "wavelengths",
    "226": "74",
    "2260": "waves",
    "2261": "way",
    "2262": "we",
    "2263": "weakness",
    "2264": "weight",
    "2265": "weighted",
    "2266": "weights",
    "2267": "well",
    "2268": "well-conditioned",
    "2269": "well-scaled",
    "227": "75",
    "2270": "well-suited",
    "2271": "well-trained",
    "2272": "well-tuned",
    "2273": "were",
    "2274": "what",
    "2275": "when",
    "2276": "where",
    "2277": "whether",
    "2278": "which",
    "2279": "while",
    "228": "767",
    "2280": "whitespace",
    "2281": "whitespace-delimited",
    "2282": "whitespace-split",
    "2283": "who",
    "2284": "whose",
    "2285": "why",
    "2286": "widely-used",
    "2287": "wider",
    "2288": "wildly",
    "2289": "will",
    "229": "768",
    "2290": "with",
    "2291": "within",
    "2292": "without",
    "2293": "wolf",
    "2294": "word",
    "2295": "word-level",
    "2296": "word_to_id",
    "2297": "wordpiece",
    "2298": "words",
    "2299": "work",
    "23": "02",
    "230": "776",
    "2300": "working",
    "2301": "works",
    "2302": "workspace",
    "2303": "world",
    "2304": "worse",
    "2305": "would",
    "2306": "wrap",
    "2307": "wrapped",
    "2308": "wrapping",
    "2309": "write",
    "231": "785",
    "2310": "written",
    "2311": "wrong",
    "2312": "wv",
    "2313": "x",
    "2314": "x1",
    "2315": "x_norm",
    "2316": "xavier",
    "2317": "xavier-style",
    "2318": "xiong",
    "2319": "xw",
    "232": "8",
    "2320": "y",
    "2321": "you",
    "2322": "your",
    "2323": "z",
    "2324": "zero",
    "2325": "zero-mean",
    "2326": "zeroed",
    "2327": "zeroing",
    "2328": "zeros",
    "233": "8-dimensional",
    "234": "8014",
    "235": "8072",
    "236": "832",
    "237": "8415",
    "238": "85",
    "239": "8538",
    "24": "0200",
    "240": "8664",
    "241": "88",
    "242": "8944",
    "243": "9",
    "244": "90",
    "245": "9093",
    "246": "91",
    "247": "92",
    "248": "921",
    "249": "93",
    "25": "0221",
    "250": "9302",
    "251": "95",
    "252": "9580",
    "253": "96",
    "254": "9746",
    "255": "99",
    "256": "9903",
    "257": "995",
    "258": "9957",
    "259": "9989",
    "26": "024",
    "260": "9998",
    "261": "9999",
    "262": "<bos>",
    "263": "<eos>",
    "264": "<pad>",
    "265": "<unk>",
    "266": ">",
    "267": "__init__",
    "268": "a",
    "269": "ability",
    "27": "0249",
    "270": "ablation",
    "271": "about",
    "272": "absolute",
    "273": "absolutely",
    "274": "abstract",
    "275": "access",
    "276": "accidentally",
    "277": "account",
    "278": "accounts",
    "279": "accumulate",
    "28": "0259",
    "280": "accuracy",
    "281": "achieve",
    "282": "across",
    "283": "act",
    "284": "acting",
    "285": "activate",
    "286": "activates",
    "287": "activation",
    "288": "activations",
    "289": "active",
    "29": "0271",
    "290": "acts",
    "291": "actual",
    "292": "actually",
    "293": "adam",
    "294": "adapt",
    "295": "adaptation",
    "296": "adaptive",
    "297": "add",
    "298": "added",
    "299": "adding",
    "3": "<EOS>",
    "30": "0275",
    "300": "addition",
    "301": "additional",
    "302": "additions",
    "303": "additive",
    "304": "adds",
    "305": "adjustment",
    "306": "adjusts",
    "307": "adopts",
    "308": "advance",
    "309": "advertise",
    "31": "028",
    "310": "affine",
    "311": "after",
    "312": "again",
    "313": "against",
    "314": "aggregate",
    "315": "agreement",
    "316": "al",
    "317": "algorithm",
    "318": "alibi",
    "319": "aligned",
    "32": "03",
    "320": "aligning",
    "321": "aligns",
    "322": "all",
    "323": "allow",
    "324": "allowed",
    "325": "allowing",
    "326": "allows",
    "327": "almost",
    "328": "alone",
    "329": "along",
    "33": "0332",
    "330": "alphabetically",
    "331": "already",
    "332": "already-transformed",
    "333": "also",
    "334": "alternates",
    "335": "alternative",
    "336": "alternatives",
    "337": "always",
    "338": "ambiguity",
    "339": "ambiguous",
    "34": "0347",
    "340": "among",
    "341": "amplified",
    "342": "an",
    "343": "analogous",
    "344": "analogy",
    "345": "analysis",
    "346": "anchor",
    "347": "and",
    "348": "angle",
    "349": "angles",
    "35": "0348",
    "350": "anomalous",
    "351": "another",
    "352": "answer",
    "353": "answering",
    "354": "answers",
    "355": "antecedent",
    "356": "any",
    "357": "appear",
    "358": "appeared",
    "359": "appears",
    "36": "0349",
    "360": "application",
    "361": "applied",
    "362": "applies",
    "363": "apply",
    "364": "applying",
    "365": "approach",
    "366": "approaches",
    "367": "approaching",
    "368": "approximate",
    "369": "approximately",
    "37": "0355",
    "370": "arange",
    "371": "arbitrary",
    "372": "architectural",
    "373": "architecture",
    "374": "architectures",
    "375": "arcs",
    "376": "are",
    "377": "argmax",
    "378": "argument",
    "379": "arguments",
    "38": "036",
    "380": "arise",
    "381": "around",
    "382": "arranged",
    "383": "array",
    "384": "arrays",
    "385": "as",
    "386": "ask",
    "387": "asks",
    "388": "aspect",
    "389": "assign",
    "39": "0363",
    "390": "assigned",
    "391": "assigning",
    "392": "assignments",
    "393": "assigns",
    "394": "associations",
    "395": "assume",
    "396": "assuming",
    "397": "asymmetry",
    "398": "at",
    "399": "atomic",
    "4": "0",
    "40": "0368",
    "400": "attached",
    "401": "attend",
    "402": "attending",
    "403": "attends",
    "404": "attention",
    "405": "attention-based",
    "406": "attention-processed",
    "407": "attention-then",
    "408": "attention-weighted",
    "409": "attenuate",
    "41": "038",
    "410": "attn_out",
    "411": "attn_weights",
    "412": "authors",
    "413": "automatically",
    "414": "autoregressive",
    "415": "available",
    "416": "average",
    "417": "averages",
    "418": "averaging",
    "419": "aw",
    "42": "039",
    "420": "away",
    "421": "axis",
    "422": "b",
    "423": "b1",
    "424": "b2",
    "425": "ba",
    "426": "back",
    "427": "backbone",
    "428": "backpropagation",
    "429": "bahdanau",
    "43": "04",
    "430": "balance",
    "431": "balances",
    "432": "bank",
    "433": "bar",
    "434": "base",
    "435": "based",
    "436": "baseline",
    "437": "basic",
    "438": "batch",
    "439": "batch-independent",
    "44": "0437",
    "440": "batch_size",
    "441": "batched",
    "442": "batches",
    "443": "batchnorm",
    "444": "baz",
    "445": "be",
    "446": "because",
    "447": "become",
    "448": "becomes",
    "449": "been",
    "45": "044",
    "450": "before",
    "451": "begin",
    "452": "beginning-of",
    "453": "behaves",
    "454": "behavior",
    "455": "being",
    "456": "benefit",
    "457": "bert",
    "458": "bert-base",
    "459": "bert-large",
    "46": "0442",
    "460": "best",
    "461": "beta",
    "462": "beta1",
    "463": "beta2",
    "464": "better",
    "465": "between",
    "466": "beyond",
    "467": "bfloat16",
    "468": "bias",
    "469": "biases",
    "47": "0464",
    "470": "bidirectional",
    "471": "bidirectionally",
    "472": "big",
    "473": "bijective",
    "474": "bilingual",
    "475": "binary",
    "476": "bird",
    "477": "bleu",
    "478": "bloat",
    "479": "block",
    "48": "0471",
    "480": "block's",
    "481": "blocks",
    "482": "bos",
    "483": "bos_token",
    "484": "both",
    "485": "bottleneck",
    "486": "bottom",
    "487": "bound",
    "488": "boundary",
    "489": "bounded",
    "49": "0479",
    "490": "bpe",
    "491": "branch",
    "492": "breaking",
    "493": "breaks",
    "494": "brevity",
    "495": "bridging",
    "496": "bringing",
    "497": "brings",
    "498": "broadcasting",
    "499": "broadly",
    "5": "0-1",
    "50": "048",
    "500": "bt",
    "501": "bug",
    "502": "build",
    "503": "build_vocab",
    "504": "building",
    "505": "builds",
    "506": "built",
    "507": "built-in",
    "508": "buried",
    "509": "but",
    "51": "05",
    "510": "by",
    "511": "bypassing",
    "512": "byte",
    "513": "c",
    "514": "call",
    "515": "called",
    "516": "calls",
    "517": "can",
    "518": "cannot",
    "519": "capacity",
    "52": "0538",
    "520": "capital",
    "521": "capitalization",
    "522": "capture",
    "523": "captures",
    "524": "careful",
    "525": "carries",
    "526": "carry",
    "527": "case",
    "528": "cases",
    "529": "cat",
    "53": "06",
    "530": "catastrophic",
    "531": "causal",
    "532": "cause",
    "533": "causes",
    "534": "causing",
    "535": "centered",
    "536": "central",
    "537": "certain",
    "538": "change",
    "539": "changes",
    "54": "0653",
    "540": "channel",
    "541": "channels",
    "542": "cheap",
    "543": "check",
    "544": "choice",
    "545": "choosing",
    "546": "chose",
    "547": "chosen",
    "548": "circle",
    "549": "clarity",
    "55": "07",
    "550": "clark",
    "551": "class",
    "552": "clean",
    "553": "cleanly",
    "554": "clear",
    "555": "clipping",
    "556": "clips",
    "557": "clock",
    "558": "close",
    "559": "closer",
    "56": "0721",
    "560": "cnn",
    "561": "coarse",
    "562": "code",
    "563": "coherent",
    "564": "coincidence",
    "565": "collapse",
    "566": "collapses",
    "567": "collect",
    "568": "collisions",
    "569": "column",
    "57": "0725",
    "570": "column-wise",
    "571": "columns",
    "572": "combination",
    "573": "combinations",
    "574": "combine",
    "575": "combined",
    "576": "combines",
    "577": "come",
    "578": "comes",
    "579": "common",
    "58": "08",
    "580": "commonly",
    "581": "communicate",
    "582": "communication",
    "583": "comparable",
    "584": "compare",
    "585": "compared",
    "586": "comparison",
    "587": "compatibility",
    "588": "compensate",
    "589": "compensated",
    "59": "0815",
    "590": "compete",
    "591": "complementary",
    "592": "complete",
    "593": "completely",
    "594": "completion",
    "595": "complex",
    "596": "complexity",
    "597": "component",
    "598": "components",
    "599": "compositional",
    "6": "0-3",
    "60": "0862",
    "600": "compress",
    "601": "compressed",
    "602": "compresses",
    "603": "compressing",
    "604": "computation",
    "605": "computational",
    "606": "computations",
    "607": "compute",
    "608": "computed",
    "609": "computes",
    "61": "087",
    "610": "computing",
    "611": "concat",
    "612": "concatenate",
    "613": "concatenated",
    "614": "concatenates",
    "615": "concatenating",
    "616": "concatenation",
    "617": "concentrate",
    "618": "conceptual",
    "619": "concrete",
    "62": "0885",
    "620": "conditioned",
    "621": "conditions",
    "622": "confident",
    "623": "configuration",
    "624": "configurations",
    "625": "confirms",
    "626": "conflating",
    "627": "confusing",
    "628": "connected",
    "629": "connection",
    "63": "0896",
    "630": "connections",
    "631": "consecutive",
    "632": "consensus",
    "633": "consequences",
    "634": "consider",
    "635": "consistency",
    "636": "consistent",
    "637": "consists",
    "638": "constant",
    "639": "constants",
    "64": "09",
    "640": "constrains",
    "641": "constraint",
    "642": "constraints",
    "643": "constructed",
    "644": "consumes",
    "645": "containing",
    "646": "contains",
    "647": "content",
    "648": "context",
    "649": "context-aware",
    "65": "0927",
    "650": "context-enriched",
    "651": "contextual",
    "652": "contiguous",
    "653": "continuation",
    "654": "continuous",
    "655": "continuously",
    "656": "contract",
    "657": "contracts",
    "658": "contrast",
    "659": "contrasts",
    "66": "0975",
    "660": "contribute",
    "661": "contributed",
    "662": "control",
    "663": "controlled",
    "664": "controlling",
    "665": "convention",
    "666": "convergence",
    "667": "converges",
    "668": "convert",
    "669": "converted",
    "67": "099",
    "670": "converting",
    "671": "converts",
    "672": "convex",
    "673": "convolution",
    "674": "convolutions",
    "675": "core",
    "676": "coreference",
    "677": "corpus",
    "678": "correct",
    "679": "correlations",
    "68": "0998",
    "680": "corresponding",
    "681": "corresponds",
    "682": "corrupting",
    "683": "cos",
    "684": "cosine",
    "685": "cost",
    "686": "costs",
    "687": "could",
    "688": "count",
    "689": "counteract",
    "69": "1",
    "690": "counts",
    "691": "covariate",
    "692": "crashes",
    "693": "create",
    "694": "create_embedding_layer",
    "695": "created",
    "696": "creates",
    "697": "creating",
    "698": "critical",
    "699": "critically",
    "7": "0-indexed",
    "70": "1-d",
    "700": "cross-attention",
    "701": "cross-lingual",
    "702": "cross-position",
    "703": "crucial",
    "704": "current",
    "705": "custom",
    "706": "cutoff",
    "707": "d",
    "708": "d_ff",
    "709": "d_k",
    "71": "10",
    "710": "d_model",
    "711": "d_v",
    "712": "data",
    "713": "data's",
    "714": "decode",
    "715": "decoder",
    "716": "decoder's",
    "717": "decoder-only",
    "718": "decodes",
    "719": "decoding",
    "72": "100",
    "720": "decomposes",
    "721": "deduplicate",
    "722": "deep",
    "723": "deepening",
    "724": "deeper",
    "725": "def",
    "726": "default",
    "727": "defeats",
    "728": "defined",
    "729": "defines",
    "73": "1000",
    "730": "defining",
    "731": "definition",
    "732": "degenerate",
    "733": "degrade",
    "734": "degraded",
    "735": "degrades",
    "736": "degrading",
    "737": "deliberate",
    "738": "delimiter",
    "739": "demands",
    "74": "10000",
    "740": "demonstrates",
    "741": "demonstrating",
    "742": "denominator",
    "743": "denominators",
    "744": "dense",
    "745": "depart",
    "746": "dependence",
    "747": "dependencies",
    "748": "dependency",
    "749": "depends",
    "75": "100000",
    "750": "depth",
    "751": "derived",
    "752": "describe",
    "753": "described",
    "754": "describes",
    "755": "describing",
    "756": "design",
    "757": "designed",
    "758": "despite",
    "759": "destroying",
    "76": "1016",
    "760": "destroys",
    "761": "detect",
    "762": "detectors",
    "763": "detects",
    "764": "determined",
    "765": "determines",
    "766": "deterministic",
    "767": "develop",
    "768": "deviation",
    "769": "devote",
    "77": "1024",
    "770": "dict",
    "771": "dictionary",
    "772": "did",
    "773": "differ",
    "774": "difference",
    "775": "differences",
    "776": "different",
    "777": "differentiable",
    "778": "differing",
    "779": "differs",
    "78": "1056",
    "780": "difficult",
    "781": "digit",
    "782": "dim",
    "783": "dimension",
    "784": "dimensional",
    "785": "dimensionality",
    "786": "dimensions",
    "787": "diminishing",
    "788": "direct",
    "789": "directly",
    "79": "11",
    "790": "disabling",
    "791": "discovered",
    "792": "discrete",
    "793": "discussion",
    "794": "distinct",
    "795": "distinction",
    "796": "distinctive",
    "797": "distinguish",
    "798": "distorting",
    "799": "distribute",
    "8": "00",
    "80": "1188",
    "800": "distribution",
    "801": "div",
    "802": "div_term",
    "803": "div_terms",
    "804": "divergence",
    "805": "diverse",
    "806": "divide",
    "807": "dividing",
    "808": "divisible",
    "809": "division",
    "81": "12",
    "810": "dk",
    "811": "do",
    "812": "does",
    "813": "dog",
    "814": "dominant",
    "815": "dominate",
    "816": "dominates",
    "817": "dominating",
    "818": "dot",
    "819": "dot-product",
    "82": "1218",
    "820": "downside",
    "821": "downstream",
    "822": "dramatically",
    "823": "drift",
    "824": "drop",
    "825": "dropout",
    "826": "dtype",
    "827": "due",
    "828": "duplicate",
    "829": "duplicates",
    "83": "125",
    "830": "during",
    "831": "dynamics",
    "832": "e",
    "833": "e_x",
    "834": "each",
    "835": "earlier",
    "836": "early",
    "837": "easier",
    "838": "easy",
    "839": "effect",
    "84": "127",
    "840": "effectively",
    "841": "effectiveness",
    "842": "efficient",
    "843": "eight",
    "844": "either",
    "845": "element",
    "846": "element-wise",
    "847": "elements",
    "848": "eliminated",
    "849": "eliminates",
    "85": "1289",
    "850": "eliminating",
    "851": "elsewhere",
    "852": "embed",
    "853": "embed_tokens",
    "854": "embedding",
    "855": "embeddings",
    "856": "emerged",
    "857": "emerges",
    "858": "empirical",
    "859": "employ",
    "86": "1294",
    "860": "employed",
    "861": "empty",
    "862": "enables",
    "863": "enabling",
    "864": "encode",
    "865": "encoded",
    "866": "encoder",
    "867": "encoder's",
    "868": "encoder-based",
    "869": "encoder-decoder",
    "87": "1309",
    "870": "encoder-only",
    "871": "encoder_block",
    "872": "encodes",
    "873": "encoding",
    "874": "encodings",
    "875": "encountered",
    "876": "end",
    "877": "end-of",
    "878": "enforces",
    "879": "engineering",
    "88": "135",
    "880": "english",
    "881": "english-french",
    "882": "english-german",
    "883": "english-to",
    "884": "enormous",
    "885": "enriched",
    "886": "ensures",
    "887": "ensuring",
    "888": "enter",
    "889": "entering",
    "89": "1353",
    "890": "enters",
    "891": "entire",
    "892": "entirely",
    "893": "entity",
    "894": "entries",
    "895": "entry",
    "896": "enumerate",
    "897": "enumeration",
    "898": "eos",
